In [1]:
import pandas as pd

In [3]:
dados = {'Nome': ['Anderson', 'Beatriz', 'Bruno', 'Cristiano', 'Daniel', 'Douglas', 'Elena', 'Fabricio', 'Gabriel', 
                 'Janaina', 'Luiz', 'Marcos', 'Nadia', 'Oswaldo', 'Patricia', 'Ricardo'],
        'Idade': [24, 33, 45, 29, 26, 40, 31, 42, 50, 22, 32, 22, 36, 68, 22, 38],
        'Cidade': ['Santos', 'Atibaia', 'Guarulhos', 'Atibaia', 'Santos', 'Guarulhos', 'Guarulhos', 'Atibaia', 
                   'Guarulhos', 'Guarulhos', 'Atibaia', 'Guarulhos', 'Santos', 'Guarulhos', 'Guarulhos', 'Santos'],
        'Registro': [32123, 45828, 34985, 11985, 32123, 99348, 48729, 24894, 12948, 89543, 65489, 56821, 65938, 12956,
                     75439, 45392],
        'Departamento': ['RH', 'PD', 'PD', 'ADM', 'ADM', 'RH', 'PD', 'ADM', 'PD', 'ADM', 'PD', 'ADM', 'PD', 'RH', 'ADM',
                         'PD'],
        'Formação': ['Graduação', 'Mestrado', 'Graduação', 'Técnico', 'Graduação', 'Técnico', 'Graduação', 'Técnico', 
                     'Mestrado', 'Graduação', 'Técnico', 'Graduação', 'Graduação', 'Graduação', 'Graduação', 'Mestrado']
        }

In [4]:
dafra = pd.DataFrame(dados)

# Group by 
- cidade dos funcionarios
- formacao dos funcionarios
- departamento dos funcionarios
- cidade e o departamento dos funcionarios
- departamento e a formacao dos funcionarios

## Cidade dos Funcionarios

In [5]:
print(dafra.groupby('Cidade').groups)

{'Atibaia': [1, 3, 7, 10], 'Guarulhos': [2, 5, 6, 8, 9, 11, 13, 14], 'Santos': [0, 4, 12, 15]}

In [12]:
grupo1 =  dafra.groupby('Cidade')

In [13]:
grupo1.first()

               Nome  Idade  Registro Departamento   Formação
Cidade
Atibaia     Beatriz     33     45828           PD   Mestrado
Guarulhos     Bruno     45     34985           PD  Graduação
Santos     Anderson     24     32123           RH  Graduação

## Formação dos Funcionarios

In [14]:
print(dafra.groupby('Formação').groups)

{'Graduação': [0, 2, 4, 6, 9, 11, 12, 13, 14], 'Mestrado': [1, 8, 15], 'Técnico': [3, 5, 7, 10]}

In [15]:
grupo2 =  dafra.groupby('Formação')

In [16]:
grupo2.first()

                Nome  Idade   Cidade  Registro Departamento
Formação
Graduação   Anderson     24   Santos     32123           RH
Mestrado     Beatriz     33  Atibaia     45828           PD
Técnico    Cristiano     29  Atibaia     11985          ADM

## Departamento dos funcionários

In [17]:
print(dafra.groupby('Departamento').groups)

{'ADM': [3, 4, 7, 9, 11, 14], 'PD': [1, 2, 6, 8, 10, 12, 15], 'RH': [0, 5, 13]}

In [20]:
grupo3 =  dafra.groupby('Departamento')

In [19]:
grupo3.first()

                Nome  Idade   Cidade  Registro Departamento
Formação
Graduação   Anderson     24   Santos     32123           RH
Mestrado     Beatriz     33  Atibaia     45828           PD
Técnico    Cristiano     29  Atibaia     11985          ADM

## Cidade e o departamento dos funcionarios

In [22]:
print(dafra.groupby(['Cidade', 'Departamento']).groups)

{('Atibaia', 'ADM'): [3, 7], ('Atibaia', 'PD'): [1, 10], ('Guarulhos', 'ADM'): [9, 11, 14], ('Guarulhos', 'PD'): [2, 6, 8], ('Guarulhos', 'RH'): [5, 13], ('Santos', 'ADM'): [4], ('Santos', 'PD'): [12, 15], ('Santos', 'RH'): [0]}

In [23]:
grupo4 = dafra.groupby(['Cidade', 'Departamento'])

In [24]:
grupo4.first()

                             Nome  Idade  Registro   Formação
Cidade    Departamento
Atibaia   ADM           Cristiano     29     11985    Técnico
          PD              Beatriz     33     45828   Mestrado
Guarulhos ADM             Janaina     22     89543  Graduação
          PD                Bruno     45     34985  Graduação
          RH              Douglas     40     99348    Técnico
Santos    ADM              Daniel     26     32123  Graduação
          PD                Nadia     36     65938  Graduação
          RH             Anderson     24     32123  Graduação

## Departamento e formação dos funcionarios

In [25]:
print(dafra.groupby(['Departamento', 'Formação']).groups)

{('ADM', 'Graduação'): [4, 9, 11, 14], ('ADM', 'Técnico'): [3, 7], ('PD', 'Graduação'): [2, 6, 12], ('PD', 'Mestrado'): [1, 8, 15], ('PD', 'Técnico'): [10], ('RH', 'Graduação'): [0, 13], ('RH', 'Técnico'): [5]}

In [26]:
grupo5 = dafra.groupby(['Departamento', 'Formação'])

In [27]:
grupo5.first()

                             Nome  Idade     Cidade  Registro
Departamento Formação
ADM          Graduação     Daniel     26     Santos     32123
             Técnico    Cristiano     29    Atibaia     11985
PD           Graduação      Bruno     45  Guarulhos     34985
             Mestrado     Beatriz     33    Atibaia     45828
             Técnico         Luiz     32    Atibaia     65489
RH           Graduação   Anderson     24     Santos     32123
             Técnico      Douglas     40  Guarulhos     99348